let a = +prompt('Введите первое число', '');
let b = +prompt('Введите второе число', '');
let c = prompt('какое действие выполнить?', '');
/*   if (a !== number){
    for (let t = +prompt('Введите первое число', '' ); t !== null ;) {

    }
} */
function calc() {
if ( c == '+'  || c == 'Сложение'|| c == 'сложение' || c == 'Слажение'|| c == 'слажение' || c == 'плюс' || c == 'Плюс') {
    alert(`сложение ответ: ${a + b}`);
}
else if ( c == '-' || c == 'вычитание'|| c == 'Вычитание'|| c == 'Вычетание'|| c == 'вычетание' ) {
    alert(`вычитание ответ: ${a - b}`);
}
else if ( c == '*' || c == 'умножение' || c == 'Умножение' || c == 'умнажение' || c == 'Умнажение' ) {
    alert(`умножение ответ: ${a * b}`);
}
else if ( c == '/' || c == 'Деление' || c == 'деление' ) {
    alert(`деление ответ: "${a}" разделить на ${b} = ${a / b}`);
}
else  {
    for (let i = prompt('ошибка ввода, повторите действие ("+" , "-" , "*" , "/") ',''); i !== null  ;  ) {
       
        if ( i == '+' ) {
            alert(`сложение ответ: ${a + b}`);break
        }
        else if ( i== '-') {
            alert(`вычитание ответ: ${a - b}`);break
        }
        else if (i == '*') {
            alert(`умножение ответ: ${a * b}`);break
        }
        else if (i == '/') {
            alert(`деление ответ: ${a} разделить на "${b}" =  ${a / b}`);break
        }
        else {
            i = prompt('ошибка ввода, повторите действие ','')
            /* if ( i == '+' ) {
                alert(`сложение ответ: ${a + b}`);break;
            } */
        }

        /* alert('') ;break; */
    }
}

}
calc(); 
 /* let test = calc(); */
        /* alert(test); */